{
    "hi":"Bonjour",
    "Developed a microservices platform to manage orders, production in workshops, and deliveries. Automatically selects nearby workshops and provides real-time notifications, optimizing logistics time and costs.":"Développement d'une plateforme de microservices pour gérer les commandes, la production dans les ateliers et les livraisons. Sélection automatique des ateliers proches et envoi de notifications en temps réel, optimisant ainsi le temps et les coûts logistiques.",
    "About Me":"À propos de moi",
    "I am a full-stack developer skilled in both frontend and backend development. I create dynamic web applications using React and TypeScript, while leveraging frameworks like NestJS and ASP.NET Core for the backend. My focus is on delivering high-quality, user-friendly solutions that are both efficient and scalable.":"Je suis un développeur full-stack compétent à la fois en développement frontend et backend. Je crée des applications web dynamiques en utilisant React et TypeScript, tout en exploitant des frameworks comme NestJS et ASP.NET Core pour le backend. Mon objectif est de fournir des solutions de haute qualité, conviviales, à la fois efficaces et évolutives.",
    "What I Do":"Ce que je fais",
    "BackEnd Web Developement":"Développement Backend",
    "I am an experienced backend developer skilled in building scalable systems with modern frameworks like NestJS, ASP.NET Core, and Laravel. I specialize in creating RESTful APIs, working with microservices, and using databases like PostgreSQL, MongoDB, and Redis. I focus on clean, efficient code and leverage tools like Docker to optimize deployment.":"Je suis un développeur backend expérimenté, spécialisé dans la création de systèmes évolutifs avec des frameworks modernes tels que NestJS, ASP.NET Core et Laravel. Je me spécialise dans la création d'API RESTful, le travail avec des microservices et l'utilisation de bases de données comme PostgreSQL, MongoDB et Redis. Je mets l'accent sur un code propre et efficace et j'utilise des outils comme Docker pour optimiser le déploiement.",
    "FrontEnd Web Developement":"Développement Frontend",
    "I have strong expertise in frontend development, focusing on creating intuitive and visually appealing user interfaces with React and TypeScript. I am skilled in implementing responsive designs using CSS and frameworks like Material-UI. My experience includes optimizing performance, integrating RESTful APIs, and ensuring cross-browser compatibility for seamless user interactions.":"J'ai une solide expertise en développement frontend, me concentrant sur la création d'interfaces utilisateur intuitives et visuellement attrayantes avec React et TypeScript. Je suis compétent dans la mise en œuvre de designs réactifs en utilisant CSS et des frameworks comme Material-UI. Mon expérience inclut l'optimisation des performances, l'intégration d'API RESTful et l'assurance de la compatibilité entre navigateurs pour des interactions utilisateur fluides.",
    "DevOps Skills":"Compétences DevOps",
    "I am currently enhancing my automation skills with solid experience in Docker for containerization and some familiarity with Kubernetes, Ansible, and Terraform. I have strong proficiency in Linux environments, managing servers, and using shell scripting to automate tasks. My goal is to streamline deployment processes and improve system scalability through effective automation and infrastructure management.":"Je suis actuellement en train d'améliorer mes compétences en automatisation avec une solide expérience en Docker pour la conteneurisation et une certaine familiarité avec Kubernetes, Ansible et Terraform. J'ai une forte maîtrise des environnements Linux, de la gestion des serveurs et de l'utilisation de scripts shell pour automatiser des tâches. Mon objectif est de rationaliser les processus de déploiement et d'améliorer la scalabilité des systèmes grâce à une automatisation efficace et à la gestion de l'infrastructure.",
    "Networking and CyberSecurity":"Réseautage et Cybersécurité",
    "I have a solid foundation in networking and cybersecurity, with experience in managing network infrastructure, implementing firewalls, and securing systems. I understand network protocols and intrusion detection, and I apply best practices to safeguard data and mitigate vulnerabilities, ensuring system integrity against cyber threats.":"J'ai une solide base en réseautage et en cybersécurité, avec de l'expérience dans la gestion des infrastructures réseau, la mise en œuvre de pare-feu et la sécurisation des systèmes. Je comprends les protocoles réseau et la détection des intrusions, et j'applique les meilleures pratiques pour protéger les données et atténuer les vulnérabilités, garantissant ainsi l'intégrité des systèmes face aux menaces cybernétiques.",
    "Phone":"Telephone",
    "Location":"Emplacement",
    "Dowload My CV":"Dowload My CV"


}